Documentacion/SOA/ER03_AR_Timbrado de Complementos de Pagos/Cambios/timbradoComplemento.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Body>
		<tns:StampPaymentComplementRq xmlns:tns="http://soa.estrellaroja.com.mx/PaymentComplementBiz">
			<tns:Header>
				<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
				<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
				<tns:IssuerRfc>AMP521016875</tns:IssuerRfc>
				<tns:IssuerName>AUTOBUSES MEXICO PUEBLA ESTRELLA ROJA SA DE CV</tns:IssuerName>
				<tns:IssuerZipCode>72050</tns:IssuerZipCode>
				<tns:InvoiceDate>2021-01-26T18:50:26</tns:InvoiceDate>
				<tns:DocumentType>P</tns:DocumentType>
				<tns:AdditionalInformation/>
				<tns:TotalWords/>
				<tns:DescriptionItm>Pago</tns:DescriptionItm>
				<tns:ProdservkeyItm>84111506</tns:ProdservkeyItm>
				<tns:QuantityItm>1</tns:QuantityItm>
				<tns:VatPercentageItm>0</tns:VatPercentageItm>
				<tns:UnitKeyItm>ACT</tns:UnitKeyItm>
				<tns:AmountItm>0</tns:AmountItm>
				<tns:SubtotalItm>0</tns:SubtotalItm>
				<tns:VatItm>0</tns:VatItm>
				<tns:TotalItm>0</tns:TotalItm>
				<tns:TotalVat>0</tns:TotalVat>
				<tns:Subtotal>0</tns:Subtotal>
				<tns:Total>0</tns:Total>
				<tns:Serie>AMP</tns:Serie>
				<tns:BranchName>MATRIZ</tns:BranchName>
				<tns:BranchZipCode>72050</tns:BranchZipCode>
				<tns:ReceiverName>FIDEICOMISO F/1138 THE OAKS</tns:ReceiverName>
				<tns:ReceiverRfc>CFI170516QH1</tns:ReceiverRfc>
				<tns:ReceiverPhone/>
				<tns:ReceiverAddress>AVENIDA COUNTRY CLUB LOTE 40-A 05, BOSQUE REAL HUIXQUILUCAN</tns:ReceiverAddress>
				<tns:ReceiverExtNumber/>
				<tns:ReceiverIntNumber/>
				<tns:ReceiverColony>52774</tns:ReceiverColony>
				<tns:ReceiverCounty/>
				<tns:ReceiverCfdiUse>P01</tns:ReceiverCfdiUse>
				<tns:Currency>XXX</tns:Currency>
				<tns:IssuerTaxRegime>624</tns:IssuerTaxRegime>
				<tns:Comments/>
				<tns:Service>PAQUER</tns:Service>
				<tns:PaymentDatePc>2020-11-20T00:00:00</tns:PaymentDatePc>
				<tns:PaymentWayPc>03</tns:PaymentWayPc>
				<tns:CurrencyPc>MXN</tns:CurrencyPc>
				<tns:CurrencyExchangePc>0</tns:CurrencyExchangePc>
				<tns:AmountPc>79113.57</tns:AmountPc>
				<tns:OperationNumberPc>1</tns:OperationNumberPc>
				<tns:BankNamePc/>
				<tns:PayerAccountPc/>
				<tns:BenAccIssuerRfcPc/>
				<tns:BeneficiaryAccountPc/>
				<tns:PaymentStringTypePc/>
				<tns:PaymentCertPc/>
				<tns:PaymentStringPc/>
				<tns:PaymentSealPc/>
				<tns:VersionPc>1</tns:VersionPc>
				<tns:CustomerNumber>1097252</tns:CustomerNumber>
				<tns:AccountNumber>408002</tns:AccountNumber>
				<tns:SiteNumber>417008</tns:SiteNumber>
				<tns:LastUpdateDate>2021-01-01T05:45:14.274+00:00</tns:LastUpdateDate>
				<tns:LastUpatedby>mari.benito</tns:LastUpatedby>
				<tns:BusinessUnit>AMPERSA_BU</tns:BusinessUnit>
				<tns:ReceiptMethod>SANTANDER_3550</tns:ReceiptMethod>
				<tns:Lines>
					<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
					<tns:InvoiceNumber>4455070</tns:InvoiceNumber>
					<tns:DocumentId>D0A98E3A-204F-11EB-BF72-00155D014009</tns:DocumentId>
					<tns:Serie>AMP</tns:Serie>
					<tns:Folio>235412</tns:Folio>
					<tns:Currency>MXN</tns:Currency>
					<tns:CurrencyExchange>0</tns:CurrencyExchange>
					<tns:PaymentMethod>PPD</tns:PaymentMethod>
					<tns:PartialityNumber>2</tns:PartialityNumber>
					<tns:PreviousBalance>158227.14</tns:PreviousBalance>
					<tns:PaidAmount>-79113.57</tns:PaidAmount>
					<tns:OutStandingBalance>237340.71</tns:OutStandingBalance>
					<tns:CustomerTrxLineId>300000033118742</tns:CustomerTrxLineId>
					<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
					<tns:InstallmentNumber>2</tns:InstallmentNumber>
					<tns:ReceivableApplicationId>9857047</tns:ReceivableApplicationId>
					<tns:TrxNumber>4455070</tns:TrxNumber>
				</tns:Lines>
				<tns:Lines>
					<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
					<tns:InvoiceNumber>4455069</tns:InvoiceNumber>
					<tns:DocumentId>692A4E29-204E-11EB-BF72-00155D014009</tns:DocumentId>
					<tns:Serie>AMP</tns:Serie>
					<tns:Folio>235405</tns:Folio>
					<tns:Currency>MXN</tns:Currency>
					<tns:CurrencyExchange>0</tns:CurrencyExchange>
					<tns:PaymentMethod>PPD</tns:PaymentMethod>
					<tns:PartialityNumber>3</tns:PartialityNumber>
					<tns:PreviousBalance>79113.57</tns:PreviousBalance>
					<tns:PaidAmount>79113.57</tns:PaidAmount>
					<tns:OutStandingBalance>0</tns:OutStandingBalance>
					<tns:CustomerTrxLineId>300000033118707</tns:CustomerTrxLineId>
					<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
					<tns:InstallmentNumber>3</tns:InstallmentNumber>
					<tns:ReceivableApplicationId>300000035676207</tns:ReceivableApplicationId>
					<tns:TrxNumber>4455069</tns:TrxNumber>
				</tns:Lines>
				<tns:Lines>
					<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
					<tns:InvoiceNumber>4455070</tns:InvoiceNumber>
					<tns:DocumentId>D0A98E3A-204F-11EB-BF72-00155D014009</tns:DocumentId>
					<tns:Serie>AMP</tns:Serie>
					<tns:Folio>235412</tns:Folio>
					<tns:Currency>MXN</tns:Currency>
					<tns:CurrencyExchange>0</tns:CurrencyExchange>
					<tns:PaymentMethod>PPD</tns:PaymentMethod>
					<tns:PartialityNumber>3</tns:PartialityNumber>
					<tns:PreviousBalance>237340.71</tns:PreviousBalance>
					<tns:PaidAmount>79113.57</tns:PaidAmount>
					<tns:OutStandingBalance>158227.14</tns:OutStandingBalance>
					<tns:CustomerTrxLineId>300000033118742</tns:CustomerTrxLineId>
					<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
					<tns:InstallmentNumber>3</tns:InstallmentNumber>
					<tns:ReceivableApplicationId>300000033730833</tns:ReceivableApplicationId>
					<tns:TrxNumber>4455070</tns:TrxNumber>
				</tns:Lines>
				<tns:Lines>
					<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
					<tns:InvoiceNumber>4455070</tns:InvoiceNumber>
					<tns:DocumentId>D0A98E3A-204F-11EB-BF72-00155D014009</tns:DocumentId>
					<tns:Serie>AMP</tns:Serie>
					<tns:Folio>235412</tns:Folio>
					<tns:Currency>MXN</tns:Currency>
					<tns:CurrencyExchange>0</tns:CurrencyExchange>
					<tns:PaymentMethod>PPD</tns:PaymentMethod>
					<tns:PartialityNumber>1</tns:PartialityNumber>
					<tns:PreviousBalance>79113.57</tns:PreviousBalance>
					<tns:PaidAmount>-79113.57</tns:PaidAmount>
					<tns:OutStandingBalance>158227.14</tns:OutStandingBalance>
					<tns:CustomerTrxLineId>300000033118742</tns:CustomerTrxLineId>
					<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
					<tns:InstallmentNumber>1</tns:InstallmentNumber>
					<tns:ReceivableApplicationId>9669032</tns:ReceivableApplicationId>
					<tns:TrxNumber>4455070</tns:TrxNumber>
				</tns:Lines>
				<tns:Lines>
					<tns:CashReceiptId>300000033730818</tns:CashReceiptId>
					<tns:InvoiceNumber>4455070</tns:InvoiceNumber>
					<tns:DocumentId>D0A98E3A-204F-11EB-BF72-00155D014009</tns:DocumentId>
					<tns:Serie>AMP</tns:Serie>
					<tns:Folio>235412</tns:Folio>
					<tns:Currency>MXN</tns:Currency>
					<tns:CurrencyExchange>0</tns:CurrencyExchange>
					<tns:PaymentMethod>PPD</tns:PaymentMethod>
					<tns:PartialityNumber>4</tns:PartialityNumber>
					<tns:PreviousBalance>158227.14</tns:PreviousBalance>
					<tns:PaidAmount>79113.57</tns:PaidAmount>
					<tns:OutStandingBalance>79113.57</tns:OutStandingBalance>
					<tns:CustomerTrxLineId>300000033118742</tns:CustomerTrxLineId>
					<tns:ReceiptNumber>RENTA DE 2 UNIDADES A PARTIR O</tns:ReceiptNumber>
					<tns:InstallmentNumber>4</tns:InstallmentNumber>
					<tns:ReceivableApplicationId>300000034042315</tns:ReceivableApplicationId>
					<tns:TrxNumber>4455070</tns:TrxNumber>
				</tns:Lines>
			</tns:Header>
		</tns:StampPaymentComplementRq>
	</soap:Body>
</soap:Envelope>